# wsEditBegin

## Description
Begin workspace edit. Use the other workspaceEdit* calls and must end with a call to workspaceEditEnd.

```pascal
PROCEDURE wsEditBegin(companyName : STRING);
```

```python
def vs.wsEditBegin(companyName):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|companyName|STRING|   |

## Version
Availability: from Vectorworks 2018

## Category
* Workspaces